# n = int(input("Ввндите число: "))

# print(f"{n} % 5 = {n % 5}")
# print(f"{n} * 5 = {n * 5}")
# print(f"{n} + 5 = {n + 5}")
# print(f"{n} / 5 = {n / 5}")
# print(f"{n} // 5 = {n // 5}")
# print(f"{n} - 5 = {n - 5}")
# print (f'{n} ** 5 = {n ** 5}')
# print (f'{n} * 5 = {n * 5}')

# n = int(input("Введите 1-е число: "))
# m = int(input("Введите 2-е число: "))
# if n > m:
#     print(n)
# elif n < m:
#     print(m)
# else:
#     print(m)

# i = 0
# while i < 8:
#     print(i, end=" !! ")
#     i += 1

# print(list(range(10, 0, -1)))

# for i in range(8):
#     print(i, end=' ')

# За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m километров?
# При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
# Input:
# n = 700
# m = 750

# n = int(input("Сколько километров проезжает машина за день: "))
# m = int(input("Сколько километров проехала машина: "))
# print(f"Потребуется = {(m // n)+1} дней") # или (m+n-1)/n

# В некоторой школе решили набрать три новых математических класса и оборудовать кабинеты для них новыми партами.
# За каждой партой может сидеть два учащихся. Известно количество учащихся в каждом из трех классов.
# Выведите наименьшее число парт, которое нужно приобрести для них.
# Input: 20 21 22(ввод чисел НЕ в одну строку)

# n = int(input("Сколько учеников в классе 1: "))
# m = int(input("Сколько учеников в классе 2: "))
# d = int(input("Сколько учеников в классе 3: "))

# if n%2>0:
#     n1=n//2+1
# else:
#     n1=n/2
# if m%2>0:
#     m1=m//2+1
# else:
#     m1=m/2
# if d%2>0:
#     d1=d//2+1
# else:
#     d1=d/2

# print(f"Потребуется = {((n1+m1+d1))} парт") # или ((n+1) // 2 + (m+1) // 2 + (d+1) // 2)

# Вагоны в электричке пронумерованы натуральными числами, начиная с 1 (при этом иногда вагоны нумеруются от «головы» поезда,
# а иногда – с «хвоста»; это зависит от того, в какую сторону едет электричка). В каждом вагоне написан его номер.
# Витя сел в i-й вагон от головы поезда и обнаружил, что его вагон имеет номер j.
# Он хочет определить, сколько всего вагонов в электричке. Напишите программу, которая будет это делать или сообщать, что без дополнительной информации это сделать невозможно.
# Input: 3 4(ввод на разных строках)
# Output: 6

# i = int(input("Номер вагона i: "))
# j = int(input("Номер вагона j: "))

# if i != j:
#     print(f"В электричке {i+j-1} вагонов")
# else:
#     print("Количество вагонов определить нельзя")

# Дано натуральное число. Требуется определить, является ли год с данным номером високосным.
# Если год является високосным, то выведите YES, иначе выведите NO.
# Напомним, что в соответствии с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100,
# а также если он кратен 400.
# Input: 2016
# Output: YES

i = int(input("Введите год: "))

if i % 4 == 0 and i % 100 != 0 or i % 400 == 0:
    print(" Год високосный")
else:
    print(" Год не високосный")
