# Задача 2: Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

Решение задачи 2:
n = int(input("Введите трехзначное число: "))
sum = 0
while n != 0:
    sum += n%10
    n = n//10
print(f"Сумма цифр введенного числа: {sum}")


# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое количество журавликов,
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# *Пример:*
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

# Решение задачи 4:
n = int(input("Введите общее количесчтво изготовленных журавликов: "))
print(f"Петя сделал {n/6} журавликов, Катя сделала {n/6*4} журавликов, Сережа сделал {n/6} журавликов")

# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# *Пример:*
# 385916 -> yes
# 123456 -> no

# Решение задачи 6:
n = input("Введите номер билета: ")
sum = int(n[0]) + int(n[1]) + int(n[2])
sum1 = int(n[3]) + int(n[4]) + int(n[5])
if sum == sum1:
    print("Ваш билет счастливый")
else:
    print("Повезет в следующий раз!")

# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек,
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
# *Пример:*
# 3 2 4 -> yes
# 3 2 1 -> no

# Решение задачи 8:
n = int(input("Введите N: "))
m = int(input("Введите M: "))
k = int(input("Введите K: "))
if k%n==0 or k%m==0:
    print(f"Можно отломить {k} долек")
else:
    print(f"Отломить {k} долек не получится")