# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть
# 5 -> 1 0 1 1 0
# 2

n = int(input("Введите количество монет: "))
count_0 = 0
count_1 = 0
i = 0
for i in range (n):
    temp = int(input("Введите 1/0: "))
    if temp == 0:
        count_0 +=1
    else:
        count_1 +=1

if count_0 <= count_1:
    print(count_0)
else:
    print(count_1)
            
# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.
# 4 4 -> 2 2
# 5 6 -> 2 3

s = int(input("Введите сумму чисел: "))
p = int(input("Введите произведение чисел: "))
d = s*s-4*p

x = (s-d**0.5)/2
y = (s+d**0.5)/2

print(x, end=' ')
print(y, end=' ')

# x = int(input("Введите сумму чисел: "))
# y = int(input("Введите произведение чисел: "))
# for i in range(x):
#     for j in range(y):
#         if x == i + j and y == i * j:
#             print(i, j)


# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N.
# 10 -> 1 2 4 8

n = int(input("Введите N: "))
i = 1
while 2**i <= n: 
    print(i, end=' ')
    i +=1