# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
# 5
# 1 2 3 4 5
# 3
# -> 1

# from random import randint as rd

# n = int(input("Введите количество элементов массива: "))
# numbers = list()
# for i in range(n):
#     numbers.append(rd(1, 51))
# print(numbers)

# x = int(input("Введите число для поиска: "))
# count = 0
# for i in range(len(numbers)): 
#     if numbers[i] == x:
#         count += 1
#         i += 1

# print(count)


# Задача 18: Требуется найти в массиве A[N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
#   5
#   1 2 3 4 5
#   6
#   -> 5

# from random import randint as rd

# n = int(input("Введите количество элементов массива: "))
# numbers = list()
# for i in range(n):
#     numbers.append(rd(1, 51))
# print(numbers)

# x = int(input("Введите число: "))
# dif_min = abs(numbers[0] - x)
# dif = 0
# for i in range(len(numbers)): 
#     a = abs(numbers[i]-x)
#     if a < dif_min:
#         dif_min = a
#         dif = numbers[i]
#         i += 1

# print(dif)

 
# Задача 20: В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко; D, G – 2 очка; B, C, M, P – 3 очка; F, H, V, W, Y – 4 очка;
# K – 5 очков; J, X – 8 очков; Q, Z – 10 очков.
# А русские буквы оцениваются так: А, В, Е, И, Н, О, Р, С, Т – 1 очко; Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка; Й, Ы – 4 очка; Ж, З, Х, Ц, Ч – 5 очков; Ш, Э, Ю – 8 очков; Ф, Щ, Ъ – 10 очков.
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, которое содержит либо только английские,
# либо только русские буквы.
# *Пример:*
# ноутбук
#     12

