# Задача 30:  Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15

a1 = int(input("Введите первый элемент прогрессии: "))
d = int(input("Введите разность прогрессии: "))
n = int(input("Введите количество элементов прогрессии: "))
result = list()
result.append(a1)
for i in range(1, n):
    result.append(a1 + d * i)
    i += 1
print(result)


# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# Ввод:  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#          0  1  2  3   4   5  6  7   8   9 10 11  12  13 14  15  16  17  18 19
# Вывод: [1, 9, 13, 14, 19]

from random import randint as rd

n = int(input("Введите кол-во элементов списка: "))
list_1 = list()
for i in range(n):
    list_1.append(rd(-100, 100))
print(list_1)

min_list = int(input("Задайте минимум: "))
max_list = int(input("Задайте максимум: "))

mass_index = list()

for i in range(n):
    if min_list < list_1[i] < max_list:
        mass_index.append(i)
        i += 1
    
print(mass_index)