# Задача 39.
# Даны два массива чисел. Требуется вывести те элементы первого массива
# (в том порядке, в каком они идут в первом массиве), которых нет во втором массиве.
# Пользователь вводит  число N - количество элементов в первом массиве, затем N чисел - элементы массива.
# Затем число M - количество элементов во втором массиве. Затем элементы второго массива
# Ввод: 					Вывод:
# 7				        	3 3 2 12
# 3 1 3 4 2 4 12
# 6
# 4 15 43 1 15 1

# n = int(input("Введите кол-во эл-тов 1-го массива: "))
# list_1 = [int(i) for i in input("Введите значения: ").split()][:n]

# m = int(input("Введите кол-во эл-тов 2-го массива: "))
# list_2 = [int(i) for i in input("Введите значения: ").split()][:m]

# for i in list_1:
#     if i not in list_2:
#         print(i, end=" ")

# Задача 41.
# Дан массив, состоящий из целых чисел. Напишите программу, которая в данном массиве выведет количество элементов,
# у которых два соседних и, при этом, оба соседних элемента меньше данного.
# Сначала вводится число N — количество элементов в массиве  Далее записаны N чисел — элементы массива.
# Массив состоит из целых чисел.

# Ввод: 			    Ввод:
# 5				    5
# 1 2 3 4 5			1 5 1 5 1

# Вывод:			    Вывод:
# 0				    2

# n = int(input("Введите кол-во эл-тов массива: "))
# list_1 = [int(i) for i in input("Введите значения: ").split()][:n]
# count = 0
# for i in range(1, len(list_1) - 1):
#     if list_1[i - 1] < list_1[i] > list_1[i + 1]:
#         count += 1

# print(count)

# Задача 43
# Дан список чисел. Посчитайте, сколько в нем пар элементов, равных друг другу.
# Считается, что любые два элемента, равные друг другу образуют одну пару, которую необходимо посчитать.
# Вводится список чисел. Все числа списка находятся на разных строках.
# Ввод:			Вывод:
# 1 2 3 2 3			2

# list_1 = [int(i) for i in input("Введите значения: ").split()]
# result = {}
# for i in list_1:
#     if i in result:
#         result[i] += 1
#     else:
#         result[i] = 1
# count = 0
# for i in result.values():
#     count += i // 2
# print(count)

# Задача 45.
# Два различных натуральных числа n и m называются дружественными,
# если сумма делителей числа n (включая 1, но исключая само n) равна числу m и наоборот.
# Например, 220 и 284 – дружественные числа. По данному числу k выведите все пары дружественных чисел,
# каждое из которых не превосходит k. Программа получает на вход одно натуральное число k, не превосходящее 105.
# Программа должна вывести  все пары дружественных чисел, каждое из которых не превосходит k.
# Пары необходимо выводить по одной в строке, разделяя пробелами. Каждая пара должна быть выведена только один раз
# (перестановка чисел новую пару не дает).
# Ввод:			Вывод:
# 300		    	220 284

n = int(input("Введите число: "))
result = {}
for i in range(2, n + 1):
    count = 0
    for j in range(1, i // 2 + 1):
        if i % j == 0:
            count += j
    result[i] = count
print(result)

result_print = []
for key, value in result.items():
    if result.get(value, 0) == key and (key, value) not in result_print and key != value:
        result_print.append((key, value))
        result_print.append((value, key))
        print(key, value)
